import TitleDocument from "../../../utils/TitleDocument";

import { Image, Collapse } from "antd";

const { Panel } = Collapse;

const panel1 = `    บริษัท เอสดับบลิว ซีสเต็มส์ แอนด์ เซอร์วิส จำกัด สำนักงานใหญ่ ตั้งอยู่ที่ บ้านเลขที่ 263/68 หมู่ที่ 3 ตำบลบ้านสวน อำเภอเมืองชลบุรี จังหวัดชลบุรี 
รหัสไปรษณีย์ 20000 บริษัท เอสดับบลิว ซีสเต็มส์ แอนด์ เซอร์วิส จำกัด ได้ทำการจดทะเบียนเป็นนิติบุคคล ตามประมวลกฎหมายแพ่งและพาณิชย์ เมื่อวันที่ 26 กุภาพันธ์
 2562 ทะเบียนนิติบุคคลเลขที่ 0205562008007

    บริษัท เอสดับบลิว ซีสเต็มส์ แอนด์ เซอร์วิส จำกัด ได้มีกรรมการของบริษัท 2 คนคือ คุณสุวิท แก้วมาลา และ คุณกัณฐิกา วงค์เครือ และมีพนักงานทั้งหมดในขณะนี้ 
จำนวน 4 คน บริษัท เอสดับบลิว ซีสเต็มส์ แอนด์ เซอร์วิส จำกัด ได้ทำการลงทุนจดทะเบียนด้วยจำนวนเงิน หนึ่งล้านบาทถ้วน เมื่อวันที่ 7 พฤษภาคม 2563

    บริษัท เอสดับบลิว ซีสเต็มส์ แอนด์ เซอร์วิส จำกัด ได้จัดตั้งบริษัทขึ้นเพื่อ ประกอบกิจการค้าและให้บริการติดตั้ง เครื่องเสียงรถยนต์ เครื่องปรับอากาศ กล้องวงจร
ปิดและ จานดาวเทียม , ประกอบกิจการค้าและให้บริการติดตั้งระบบไฟฟ้าภายในบ้านและอาคารสำนักงาน , ประกอบกิจการค้าและให้บริการติดตั้งระบบโทรศัพท์และ
อินเตอร์เน็ตภายในสำนักงาน
`;

const panel2 = `    ปัจจุบันเรามีการให้บริการที่มีหลากหลายด้านในการให้บริการ ที่เอสดับบลิว ซีสเต็มส์ แอน์ เซอร์วิส มีประสบการณ์ และพร้อมที่จะให้บริการลูกค้าทุกท่านอย่าง
เต็มความสามารถ ได้แก่

    - รับออกแบบและติดตั้งระบบไฟฟ้า บ้าน อาคาร สำนักงาน
    - จำหน่ายและติดตั้งกล้องวงจรปิด CCTY
    - บริการย้ายและติดตั้งเซิร์ฟเวอร์
    - จำหน่ายและติดตั้งเครื่องปรับอากาศ
    - บริการทำความสะอาดเครื่องปรับอากาศ
    - จำหน่ายและติดตั้งจานดาวเทียม
`;

const panel3 = `    เป้าหมายของการทำงาน ตั้งแต่เราทำการก่อตั้งบริษัทขึ้นมา ก็เพื่อเข้าถึงลูกค้าและตอบโจทย์ลูกค้าทุกกลุ่ม เพื่อเป็นผู้นำด้านรับติดตั้งกล้องวงจรปิด เครื่องปรับอากาศ 
ระบบไฟฟ้าภายใน บ้าน อาคาร สำนักงาน และระบบรักษาความปลอดภัย
`;

const History = (props) => {
  return (
    <>
      <TitleDocument title={props.title} />

      <section className="text-gray-600 mb-12">
        <div className="container px-5 pt-20 mx-auto">
          <Image preview={false} src={`${process.env.REACT_APP_PUBLIC_URL}/assets/images/information/history.png`} />
          <Collapse accordion>
            <Panel className="text-2xl whitespace-pre-wrap" header="ประวัติบริษัท" key="1">
              {panel1}
            </Panel>
            <Panel className="text-2xl whitespace-pre-wrap" header="บริการในปัจจุบัน" key="2">
              {panel2}
            </Panel>
            <Panel className="text-2xl whitespace-pre-wrap" header="เป้าหมายในการทำงาน" key="3">
              {panel3}
            </Panel>
          </Collapse>
        </div>
      </section>
    </>
  );
};

export default History;
